# https://code.mu/ru/python/tasker/stager/1/1/
# Уровень 1.1 задачника Python


# Задача 1
# Дано число. Проверьте, отрицательное оно или нет.
# Выведите об этом информацию в консоль.

# number = int(input("Введите число для проверки на положительность: "))
# if number < 0:
#     print("Введенное число отрицательное.")
# elif number == 0:
#     print("Введенное число рано 0.")
# else:
#     print("Введенное число положительное.")


# Задача 2
# Дана строка. Выведите в консоль длину этой строки.

# txt = input("Введите строку:\n")
# print("Длина строки -", len(txt)) #как проверять длину строки?

# Задача 3